package filter.policy

import filter.dto.Profanity

internal object ProfanityPolicy {
    @JvmField
    val DEFAULT_PROFANITY_LIST = listOf(
        // 핵심 욕설
        "ㅅㅂ", "ㅆㅂ", "씨발", "씨바", "시발", "시바", "시팔", "씨팔", "씌발", "씌팔", "슈발", "쒸발",
        "18년", "18놈", "18새끼",

        // '개-' 계열
        "개자식", "개같은년", "개간놈", "개간년", "개넘", "개년", "개놈",

        // '존/좆' 계열
        "존나", "졸라", "존니", "좃나", "조까", "좆", "조또", "젓밥",

        // '병신' 및 변칙
        "병신", "븅신", "뷩신", "빙신", "병딱", "병닥", "븅쉰", "벵신",

        // '지랄' 및 변칙
        "지랄", "지럴", "지랼", "지뢀", "찌랄", "쥐랄",

        // '새끼' 및 변칙
        "새끼", "세끼", "쌔끼", "쉐끼", "쉑", "새뀌", "색기",

        // 성적 비하
        "보지", "자지", "씹", "쓉", "버지", "뽀지", "잠지", "봉알", "부랄", "불알", "붕알", "뽕알", "고환",
        "섹스", "쎅쓰", "쌕스", "쌕쓰", "색스", "섹히", "사까시", "오랄", "자위", "딸딸이", "정액", "정자", "콘돔", "항문", "후장",
        "창녀", "창남", "걸레", "강간", "성폭행", "애무", "유두", "유방", "따먹",

        // 비하 및 기타
        "니기미", "니미", "애미", "에미", "애비", "에비", "쌍년", "쌍놈", "상년", "호로", "양아치", "애자", "찐따", "찌질이",
        "엠창", "엄창", "엿먹어", "아가리", "닥쳐", "주글년", "허접", "쓰레기",

        // 영문
        "fuck", "bitch", "pussy", "penis", "sex", "asshole", "shit"
    ).map { Profanity(it) }.distinct()
}